{"config": [{"config": {"units": 512, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_7", "bias_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 784], "dtype": "float32"}, "class_name": "Dense"}, {"config": {"name": "dropout_5", "trainable": true, "rate": 0.9}, "class_name": "Dropout"}, {"config": {"units": 512, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_8", "bias_constraint": null, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "trainable": true, "rate": 0.9}, "class_name": "Dropout"}, {"config": {"units": 10, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_9", "bias_constraint": null, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}